Config/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/HTTPServices/users/Ext/Module.bsl
Функция getUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос;
	ЗапросПользователи.Текст = 
	"ВЫБРАТЬ
	|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
	|    Пользователи.Наименование КАК Наименование,
	|    Пользователи.Код КАК Код
	|ИЗ
	|    Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|    НЕ Пользователи.ПометкаУдаления
	|    И Пользователи.Наименование = &Наименование";
	ЗапросПользователи.УстановитьПараметр("Наименование", Логин);
	
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Ответ = Новый HTTPСервисОтвет(401);
		Ответ.УстановитьТелоИзСтроки("Пользователь не найден!");
		Возврат Ответ;
	КонецЕсли;
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("quid", Строка(Выборка.Ссылка));
	ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
	ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция registerUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
	
	ЗапросПользователи = Новый Запрос;
	ЗапросПользователи.Текст =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.Код КАК Код
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.Наименование = &Наименование";
	ЗапросПользователи.УстановитьПараметр("Наименование", Логин);
	
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользовательИБ.Имя = Логин;
		НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		НовыйПользовательИБ.Записать();
		
		НовыйПользовательКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйПользовательКонтрагент.Наименование = Логин;
		НовыйПользовательКонтрагент.КонтактныйТелефон = Телефон;
		НовыйПользовательКонтрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;
		НовыйПользовательКонтрагент.Комментарий = "Контрагент зарегистрирован через мобильное приложение.";
		НовыйПользовательКонтрагент.Записать();
		
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = Логин;
		НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
		НовыйПользователь.Клиент = НовыйПользовательКонтрагент.Ссылка;
		НовыйПользователь.Записать();
		
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("quid", Строка(Выборка.Ссылка));
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		
		Ответ = Новый HTTPСервисОтвет(200);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
		СтрокаОтвета = ЗаписьJSON.Закрыть();
		
		Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
		
		Возврат Ответ;
	
	Иначе 
		Ответ = Новый HTTPСервисОтвет(409);
		Ответ.УстановитьТелоИзСтроки("Пользователь с таким логином уже существует.");
		Возврат Ответ;
		
	КонецЕсли;
	
КонецФункции
